app/views/dashboard/index.html.erb

    <h1 align="center"> $tobeaddedrubycode</h1> <br>
    <h4 align="center"> <%= Transaction.where(status: "pending").count %> Pending Requests </h4>
---
SELECT COUNT(*) FROM "transactions" WHERE "transactions"."status" = $1  [["status", ""]]