app/views/requests/index.html.erb

			<td><%= t.transaction_id %><br><%= t.updated_at %></td>
			<td><img src="<%= t.traveller.photo %>"> <div><%= t.traveller.firstname %> <br> <%= t.traveller.email %></div></td>
---
SELECT  "travellers".* FROM "travellers" WHERE "travellers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]