app/controllers/completeapi_controller.rb

  def index
			  	# if params[:transref].present?
			  	# 	transaction = Transaction.find_by(reference: params[:transref])

			  	# else
			   #    transaction = Transaction.all
			   #    # render json: { errors: transaction.errors.full_messages }, status: :unprocessible_entity

			  	#  # notice: "failure"
			  	# end

			  	# render json: transaction.to_json


				  			if params[:transref].present?
								@transaction = Transaction.where("reference = ?", params[:transref])
								else
								@transaction = Transaction.all
---
SELECT "transactions".* FROM "transactions" WHERE (reference = 'KXHQN6MPSORID6LG')
SELECT "transactions".* FROM "transactions"