app/controllers/merchants_controller.rb

	def index

		if params[:request_amount].present? || params[:request_zone].present?
			 @user = User.where("merchant_amount > ?", params[:request_amount]) && User.where("merchant_zone = ?", params[:request_zone])
			else
			@user = User.all
---
SELECT "users".* FROM "users" WHERE (merchant_amount > request_amount)
SELECT merchant_amount > ?, 2 FROM "users"

	 def show
	 		 render json: @user.to_json

	 	  	render json: User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]