app/controllers/profile_controller.rb

UPDATE "users" SET "merchant_avatar" = ?, "merchant_id" = ?, "merchant_address" = ?, "merchant_amount" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["merchant_avatar", "imgur.com"], ["merchant_id", "poon da qian"], ["merchant_address", "3 surrey road"], ["merchant_amount", "1000"], ["updated_at", 2016-12-03 07:42:35 UTC], ["id", 1]]
---
	def update
 @edit = current_user
 @edit.update(stupid_param)