app/controllers/requests_controller.rb

  def index
  	@traveller = Traveller.all
  	@request = Transaction.where(status: "pending")

  	  @transactions = Transaction.select{ |transaction| transaction.user_id == current_user.id}
---
SELECT "travellers".* FROM "travellers"
SELECT "transactions".* FROM "transactions" WHERE "transactions"."status" = $1  [["status", "pending"]]
SELECT "transactions".* FROM "transactions"