app/controllers/setting_controller.rb

	def update
 @edit = current_user
 @edit.update(stupid_param)
---
UPDATE "users" SET "merchant_avatar" = $1, "merchant_id" = $2, "merchant_address" = $3, "merchant_status" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["merchant_avatar", "31231"], ["merchant_id", "test"], ["merchant_address", "test"], ["merchant_status", "test"], ["updated_at", 2016-12-08 10:25:49 UTC], ["id", 2]]