app/controllers/transactionapi_controller.rb

  def index
		render json: Transaction.all
---
SELECT "transactions".* FROM "transactions"

  def create
   # transaction =  Transactions.create(
   #                travellers.firstname: params[:firstname],
   #                travellers.lastname: params[:lastname],
   #                travellers.email: params[:email],
   #                travellers.number: params[:number],
   #                travellers.photo: params[:photo]
   #                amount: params[:amount]
   #                selectedmerchant: params[:selectedmarchant]
	# 								)
		@traveller = Traveller.new(
											firstname: params[:firstname]  ,
		                  lastname: params[:lastname] ,
		                  email: params[:email] ,
		                  number: params[:number] ,
		                  photo: params[:photo]
		                  )

		@transaction = @traveller.transactions.build(
											amount: params[:amount]  ,
			                # selectedmerchant: params[:selectedmerchant]  ,
			                user: User.find(params[:merchant_id])  ,
			                status: "pending"  ,
                      fee: params[:amount].to_i / 10 * 0.50  ,
                      :total4trans params[:amount] ,
                      token: params[:token] ,
                      fullamount: params[:fullamount]
                  	)
		@traveller.save
---
SELECT  "travellers".* FROM "travellers" WHERE "travellers"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."traveller_id" = $1  [["traveller_id", 17]]
INSERT INTO "transactions" ("amount", "status", "created_at", "updated_at", "traveller_id", "user_id", "reference") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["amount", 500], ["status", "1"], ["created_at", 2016-12-13 12:23:10 UTC], ["updated_at", 2016-12-13 12:23:10 UTC], ["traveller_id", 42], ["user_id", 1], ["reference", "7SVP4ZQW7X4YEYLT"]]
INSERT INTO "travellers" ("firstname", "lastname", "email", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["firstname", "poon"], ["lastname", "king"], ["email", "poondq@gmail.com"], ["number", "100830382038000"], ["created_at", 2016-12-14 05:11:47 UTC], ["updated_at", 2016-12-14 05:11:47 UTC]]