app/controllers/transaction_controller.rb

	def index
		 		@completed = Transaction.where(status: "completed")
		@traveller = Traveller.all
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."status" = $1  [["status", "completed"]]
SELECT "travellers".* FROM "travellers"

	def edit
  	@transactions = Transaction.find(params[:id])
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]