app/controllers/traveller_controller.rb

  def index
		  	render json: Traveller.all.to_json
---
SELECT "travellers".* FROM "travellers"