app/controllers/travellers_controller.rb

SELECT "travellers".* FROM "travellers"
---
  def index
		render json: Traveller.all

INSERT INTO "travellers" ("firstname", "lastname", "email", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["firstname", "tim"], ["lastname", "gunn"], ["email", "timgunn@aol.com"], ["number", "100830382038.000"], ["created_at", 2016-12-10 09:35:24 UTC], ["updated_at", 2016-12-10 09:35:24 UTC]]
---
  def create
   traveller =  Traveller.create(
                  firstname: params[:firstname],
                  lastname: params[:lastname],
                  email: params[:email],
                  number: params[:number]
                )